import React from 'react';

export const provinces = {
    "تهران": ["تهران", "شهریار", "اسلامشهر"],
    "خراسان رضوی": ["مشهد", "نیشابور", "سبزوار"],
    "اصفهان": ["اصفهان", "کاشان", "خمینی شهر"],
    "فارس": ["شیراز", "مرودشت", "جهرم"],
    "خوزستان": ["اهواز", "دزفول", "آبادان"],
    "آذربایجان شرقی": ["تبریز", "مراغه", "مرند"],
    "مازندران": ["ساری", "بابل", "آمل"],
    "آذربایجان غربی": ["ارومیه", "خوی", "میاندوآب"],
    "کرمان": ["کرمان", "سیرجان", "رفسنجان"],
    "سیستان و بلوچستان": ["زاهدان", "زابل", "ایرانشهر"],
    "البرز": ["کرج", "فردیس", "کمال‌شهر"],
    "گیلان": ["رشت", "بندر انزلی", "لاهیجان"],
    "کرمانشاه": ["کرمانشاه", "اسلام‌آباد غرب", "جوانرود"],
    "همدان": ["همدان", "ملایر", "نهاوند"],
    "لرستان": ["خرم‌آباد", "بروجرد", "دورود"],
    "مرکزی": ["اراک", "ساوه", "خمین"],
    "اردبیل": ["اردبیل", "پارس‌آباد", "مشگین‌شهر"],
    "قزوین": ["قزوین", "تاکستان", "الوند"],
    "یزد": ["یزد", "میبد", "اردکان"],
    "قم": ["قم", "جعفریه", "کهک"],
    "هرمزگان": ["بندرعباس", "میناب", "دهبارز"],
    "گلستان": ["گرگان", "گنبد کاووس", "علی‌آباد کتول"],
    "زنجان": ["زنجان", "ابهر", "خرمدره"],
    "بوشهر": ["بوشهر", "برازجان", "گناوه"],
    "کردستان": ["سنندج", "سقز", "مریوان"],
    "چهارمحال و بختیاری": ["شهرکرد", "بروجن", "فرخ‌شهر"],
    "کهگیلویه و بویراحمد": ["یاسوج", "دوگنبدان", "دهدشت"],
    "خراسان شمالی": ["بجنورد", "شیروان", "اسفراین"],
    "ایلام": ["ایلام", "ایوان", "دهلران"],
    "سمنان": ["سمنان", "شاهرود", "دامغان"],
    "خراسان جنوبی": ["بیرجند", "قائن", "فردوس"]
};

const CitySelector = ({ selectedProvince, selectedCity, onProvinceChange, onCityChange }) => {
    return (
        <>
            <div className="form-group">
                <label>استان</label>
                <select name="province" value={selectedProvince} onChange={onProvinceChange}>
                    <option value="">انتخاب استان</option>
                    {Object.keys(provinces).map(province => (
                        <option key={province} value={province}>{province}</option>
                    ))}
                </select>
            </div>
            <div className="form-group">
                <label>شهر</label>
                <select name="city" value={selectedCity} onChange={onCityChange} disabled={!selectedProvince}>
                    <option value="">انتخاب شهر</option>
                    {selectedProvince && provinces[selectedProvince] && provinces[selectedProvince].map(city => (
                        <option key={city} value={city}>{city}</option>
                    ))}
                </select>
            </div>
        </>
    );
};

export default CitySelector;
